#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "9dfa898706165e06fee5786a51040cb4" -> "46c2e370f3d4c7c8717812e20d7388d2"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "f7d4edc078bda15294565d6cfdbb4737" -> "11502752a7a2e41b817be7656001fd61"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "970b7c4bf1defaa1f499971e2f7dadc3" -> "d18e927efe52d470c799e2d4f2ea4411"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3fa3575a0f5112e5c8c40afd55a758b0" -> "86f88710efcc6ac7c916528ffac4ded3"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "0d464f3283f262cbf398ef393004c540" -> "f9aaeeef14d4428bf7f6dfb18afc306f"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "016542daaf80f0c180aa8f18538d3dfc" -> "20efa0cf6f492252f2d17957355ccded"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "c6259c5a67c3cf8fb3ac4bedf5ccd3b6" -> "9cd4f8bae82c919c3b2862b2e804665c"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "46680c67f504af0c44590134fa7ab838" -> "d41524047b4a9a8191965e0d018f5b23"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "73b6dc0f9e328b1816fa39283cff23ad" -> "96e85e91b46648dbf82931ce39ad55f5"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "17fadbf5bf91ace5143a5bff090faa0b" -> "fae52d5df562b0286f3338ede20454b1"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "fc0e5fcadb4245c70c1bd5b2aa565be6" -> "e7d82bad5ea17f063175ac9243fdbc22"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "cf54d329a8f017242dc7a520d6e36bc7" -> "da24a86684e3993b57f8792b2fe37bec"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "85f36bc683aed55811b365952aaff534" -> "eeab977c27c33343b3c4027c579679ee"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "4e856f4d1b73d6a2d45357bffae91d5a" -> "32655560dddc262cf0677e439b06f13a"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "2a0240eaea5433be9626abd29dcca298" -> "707e4d305665ddddcbed32d93600f861"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "c2226ca979dca0e1937d757a23368892" -> "f377f8dddc1d9419bf1256873de03ef6"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "b3b756f720dc6616e83d10ce3c3b23a6" -> "68e3e7f45d07fce0e1e70689af9b4f36"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "e88e48fbf7e3454e6ba1b752b7200074" -> "198c078ebb1d0749cc0ad238a6082156"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "15d804038a669bbedba23babc581ca02" -> "00234cd80584e6f94b8b0f75dd69729c"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "a951b2420b06664046f510d417b58cf1" -> "b05d6a648e55c1d7551929424ddbfdf7"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "4ae13af65e628ac94e0a4a61409a27d0" -> "28cbab6b54c04c6b124f53cdf482f3ad"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "4b710a6eb51ffb8a3cbdcf1a00d8bd6d" -> "f56e8ccec94fec8de6192b67065b500d"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "38eb2b445c60b083aae5bc5b013eebe7" -> "31b02351db4433aebd63b0b4c30bf9b3"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "1dfb7ebc0fcaaad1afa567aaef27b5eb" -> "1ed1c382e37c3404ded6d6af0bf3b4a9"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "289c3dd493563906c7488b5fdc5c0604" -> "2764b6674f17410e9724f3e139ee7a34"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "cb3fee2cc35e48109801f753484ff7ac" -> "952df020e9e8f119894fe40c60409f62"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "e38f25ef87b26bb1c8177263d0a36c2f" -> "1b009ff83c655773da4da3f8c622a849"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "abbc5edf82350fb0547c107088d026c9" -> "5583e595d5cc721ead3204aead8425f6"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "c6467d705ac18c70bab6f2ab56032e78" -> "578a2937a24f4e5ea54c7a1385fa8a1f"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "1b084492e1b80e145b9ea3392fc6c8ab" -> "beaec3b465588ac3c9e61e54907e833b"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "62d7077847632fb1ffdaedccafd5961c" -> "6f3debec3c92a9d22c5c3a71385c9eb9"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "53fd74a9e5ad9dc42689d9662223183b" -> "47b1c420d88a1a9976fb93f08d04854c"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "c0eb681921fb2e54d75154546bb7a128" -> "dc561e41f030534f7adabaa318f42bed"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "b1c641e4df619b5937437173fcc85642" -> "5908411c1dc2f2bdc058491748820322"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "3a0a082f04922f129fa7cea523f8f1da" -> "7b54b5081d19cb0cd61cbb1b6efb9723"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "db024e45b13fc4edd5998723f8c07434" -> "85b745ac92331059eab99d284e06a3bd"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "769882068a1d2207aa75ad4d4b090054" -> "a80cadad7afe5d42557505fd4c67a7c2"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "d3645613e032a32a24478e03c698c453" -> "dca0697c0c9d3c4fbb462c1871793d5b"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "cfdf65af28517a3028b411b05c3945c8" -> "b3d3fe9a1073e46e491f05946803e4e0"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "570ebd803319745416a5ec1c2e3b3d1e" -> "dbc62106a2a2a89a680c79b38443a330"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "9bd92fbf2e3c88037ae4d40d95ae30da" -> "537fe2e28e6e3d0ae1c386590c8e393c"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "4894514ec3154ab067ac95c5109879b3" -> "a565790cc48bcd805155def133f90345"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "2a9498fc952184fe7fe5f33f28d79297" -> "ecaf20227093bd0c72d91641b36e1910"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "73d080922ea50a7347c063a932894f7c" -> "36c83a66ee1510a98799c46d90caad62"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "81b0157ed85d1c597d65afe145175ac9" -> "c479e7b2b7279989f3f45d58b429aa88"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "71d3e0a7ccf4fb1585ad81053fa793f6" -> "d35482b97462ed3741d1d70bee65542d"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "55f28fa4dd4a73b65b546d9198b4f5cd" -> "967e69b399d49c2ac93b6ad8a827db57"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "vr7QrhnFA8t9frYLxEk3+sgOQwgxvoCJ3v/xZQWqajw=" -> "VbTpErogp4HODY/QDJ2WpP42UEArpIdyTznGsQBwUDw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "OfKiET7fSTptKruCAi3eIfVpvo1AaKOssyfXwb41WnE=" -> "qfbF1FjVXrzeRzXH+hVIoim4mK55S8Z2dSutY7GmJ/s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S4ee+qHw8+SM/BDZJU1boiGllIG2EPOskqAXyHr++fY=" -> "zAMvkOV0EO/vGA7UrVfs7B2ekSErrpYggrUmz12CiKU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "CaVX2Xf6WjmmlEWACLVBKDPapUE/RuV8fOZEYq/auKs=" -> "jFH4vLQ7z66PMYOrdGoVJ0YiX6T1PfjvEmpu1XjVTAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "NOwxYsyEDmsLGOpTAnLftN7FC97RVb/Th1diQHwwXlc=" -> "+N70UzdBvmhIkuNr1Vk4HPyMzl8o3xvEgBjGwnI1Vj0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "WZuN1QLX5A0bMwgp1PnP6FGDTvoVzD9der+Zvflc6o4=" -> "1qVVb/KBfLV+hSR278BibEYApPat1vk/aa3SKYbbE78="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "CcIxqTF7qPtWfTkShvjh7XkvjPxPC5g9gI69l+/O3WA=" -> "Wd2b/xUBp77lFQ9Nzb0xs1SF6C5/bxylbE1lxHuhhMc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "QFwEsl5V9rTSbBXtOq9/3GetewBME9ft5t6ndqMJOq0=" -> "gfLd/nhEFRleJVhN+y+EvZr4Nd9zk+zgrDTmjzUKzBQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "GmGWM8ttJWYL2bxlEkkqKIPE9jG+7PwW+i2nAgSIIxs=" -> "3Ek/kUOeCuBc+9MAdtyDuPQHLvs0nn5nwpXf8VlHT/Q="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BpmH+dwHEYjKrUWMr8krlWtFN05z2qxW5bzqN/b7M2I=" -> "BUi8jDCkBnUTedJ3H4W1dIEdRLa3yNYjW7iikT2GVQ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "iYC48jujmYvuimJJ5OnhtKKgTMYySsYGnn1D/MZNUCs=" -> "gTkwgYgzpjrqI7WmxQv2cyqumlSgoAYhsAN5lTNQYhg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "jF7kV8VgN0fvl7DhjsNUF435u3gqVHKxmozUU0KQQ5c=" -> "h4NEPw4Vjc633idLZdtOAU4WRwbJUf09XYwj7mDk50A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "V/fGpvPr7mk7kXto08QfyMgLyVNu0l/iE1Ohy3aEpGg=" -> "5seH3EC+s49fI3oSvzBMuysQ015esavGx4Kow0pm2pc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "9V9ulfqtQpRnv04XCDI4td/RQcpY1WiWmvu1GLaYUIc=" -> "1crWnB+xQUJF+5mHW0okbk8OOUXZMdQtcmkhMb/Za58="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kAD5QQO1vw881BKmJijTBg1uGb2YwLj3Kgy79NfFP0c=" -> "MjXbbz2E6CIzENNwyd31hAZ5m/6rPBi9XCmiedS4bd4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "hpx8rPd/R1upgj1Evlu8ROO4g6c2F812XhPm2wixlfo=" -> "6Ot+A1etRjVOBzuRKyFoW+iuf0XLBf0zEamUNvC1iOg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZdKjnfBpu1thx2oCBi8ofW+0mYW6l/gT7sLSjvPHOZE=" -> "7gFiJmEiQqQTdbNjPADdh5TKtsN9mNHU83xvqp5vGsc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "UojKfN8YCvdfMvdiJCfX+mMHqoVxaYrSgNDjKgo6WGo=" -> "1296JydS1TsdXfFzp+X/6Joo+N5DQQsSbJrvhhknU3w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "BCg9tUn+7iiyfaLqwLbWgXqc5lHcmEAOfhrEgWHLfTM=" -> "nWexnMcr4ll/2HKifpRYQZRnfhCUniNhvowbWUhZBj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "PntiIDQmYUeA0iaGrl5Bo42F9b/zKz0Jo+vIVl/uqyk=" -> "OCNJSOBInd/jGcccPSvswmkMC6vEuwhsRKfMAeqrGrk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cgTg9aqLS/7ad8gEhvyMMSwo+JQa2b6RQdU8ub+Luq4=" -> "swf5LFNEtzCYeMl1lpr4YFBIrqbKWVoSWG3b1fmoqqo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8H/BiddRAkkdXQ+O0EgjpGwJJB2ouRkwvmgAC672u8=" -> "5Fq4ALzB54k5DLyV7SXxuTpQu2T1NhjEC5oc8AbU4/o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "imTynxs4TwjJsaS6tkqyqiU6Bkx5cs02QIQiNvc9Uh8=" -> "jgk1AmjIYnb7eB1NicaHx1AR2RAVJgM2Xz3nV04V9/w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "c+Vr/Vh1jJUTSOACQmqGwjm7rdxHY0GbW2yrLAMj814=" -> "R0z8bFlnNtoArajw9ZsAXRwTv7hb2P+0fTdQ6y9fbDE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ux6YyJEo9q7PNdQDXHiwgb0rrRmk+iNWrWTj074hGZ0=" -> "M/8GBP/LT73Lo280SM+DTv1UWtlkMGAgnHvgDl0yz8M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dpPlC/ilBFFhxOYXwvzRWfdsBqpybWocnow+rsCBNTI=" -> "zBaB4D9M+hmHQZNZcgGXn9rw0dk8beCCLHFKO899eyM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "OiTFYPO+aubAY7r1KgGicMg96e2voqNaTbMpvc2WnIY=" -> "5vPBYD2yP60WblpjoeGIGUZGpH28PhABOh9hmnCXv6w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "WP7dnjKJfipoQ7Qwd/WMeDoAqKcY9amt8EzIo0Rgm9o=" -> "HjpwJwYwi7MXsFrYsF8gd2oSM60jKG8OnSZubqoUmSY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q7UfKocfLxSdFJpx78BH2puJxxlcdJqVMTPR2vQe9vA=" -> "hEXvMbOS/+l1AEhAdOeSOGgXDu0WkHfQLse67sNo3u8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpS1U9Z5EWsbvJ22Gebp2q5d+Rha5ROifSBpRzDe2z4=" -> "f36ra7oWD+mmYO0cU83sBqLOoNx74XR+7zTmaIfBIl8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "xZh8MKgogEhby4yv+0WzGdPm3BjZGDOWPevuCzLYyHE=" -> "4Ic5XQuP2K8PHLpECEoryRekYj06KqN5BYNQP86X3XA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvcVYR9coVEp9/xdxoNbyPwyKM2Hv2trjKWymEY9QCw=" -> "ZBPRBr+toFKelba6tyORIjSZt41sbiroTYOKh7HQbDE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "zP9mWIr1qBfsIWU5+X1QavzeBr6JgkxNBFssZsnDwXQ=" -> "ueL7LsORmKJHislfj90m+extu5mf29haDGiRRDCYZw4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPl2jPVb+cRwssZ7zZuWbKSwqkVfXOPjwb6UGEcYAhQ=" -> "P5s+bpVpyl5zANAxEZtPmM2TcKqMGk3dxBpTT34BQxI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S2Q5x/riPAAexMLNJEwtllgImcWdZboGh05VwKodwHc=" -> "Zwr4P/dXwOSRLhoDSoW7Z5UO9oBE3wi0JTuQe+Kojz4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "JqbHgTvnMAwRBy0/M1NSE3Ni60EH4PCwBfjdHYXVBt4=" -> "RYmlOj5CfqJzihZ/4AotUZub6v8gB5GfbvtjkWH17Us="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "/yJShIEG7ngEWc5BPmKSkJkbaqR56B5MIGAUu+Ga8xM=" -> "fixE4CyY5bqFMlL4lrjx/cknKNXUf6HN8XlVWhgH9G0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "m3D9KozMG7tlqi29QgIIDP6LUfzPzb74ic/9yGZRTao=" -> "gGK1X6ofsiqDbHZ/tz12wOqRqRO+i0FqV41jnjYhQpc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W2r67VfWc58ROol2GoZ5Ohg5weHdqEE86MZjH41jjk=" -> "oLjPzk1E19A+zTJI3oXbSWTsHbYoaogip63KaIcIGLk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z6iXU2Xl7Jswk5KptoRuoNFraddADHzEIZz7lqLyX40=" -> "jUCS/zjdedr9F2iodow2v3Doqj7KC/XhtAE1Ch1cv34="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "xaVn/8EHWkR3pt5t+6o27iEAmuXMWuv9mg4T6OEQtb8=" -> "b0l1Bxn4o8XUggJI/9rSxo3ZJbDM70kpc2dGSVOrPGk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Kz3ylBq8c14k13cr2WZQDH47cHOlLGl0NUOVF01ifw0=" -> "1S5Hq7kih9Jx55boe+AcNMqM3tTvuga1NHc4dU5wFUU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "qCP3o5noUURd1OoLCNRC1skcQ7MWc6mcS8Sq6ygCJbI=" -> "rBItXciYEyYcr+vJFatwvAs/R2TnCSh97D323x2rw7E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gJVPbubwmLTDEAz6O6o9/kmPIV9vNahTEHmweTquh6U=" -> "AQLLP859+XiepNKdTfZU9ZItneEFSLgwontpCm27uMc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "02A+jeS74O2i83wYRA4JPKJqWtILDJK5CIrIIG/CzUs=" -> "Qa4tsdEmKFwqx1seeoBzlyVVATelX3WhCYMM7Umr9mk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "L3NIq7fOjadd0meOAQCM/S3Q4hEUci656YK/pYNGdeI=" -> "mXo70q/ww9jWmMN7PBgJ+nLRfrHMCwdsl/6hQ70ClAc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-03-01T03:34:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vzsy71" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-03-01T03:34:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-03-01T03:34:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*